Repository: aenccambodia/S4A-Khm.po
Catalog: khm.po
Languages: khm

source: Language-Name
khm: ភាសាខ្មែរ

source: Language-Direction
khm: LTR

source: Suppress-Bold
khm: true

source: Win-Font
khm: KhmerOSbattambang_0

source: %H sensor value
khm: តំលៃ ឧបករណ៍ចាប់សញ្ញា %H

source: %L contains %s
khm: %L មាន %s

source: %a of %m
khm: %a នៃ %m

source: %b and %b
khm: %b និង %b

source: %b or %b
khm: %b ឬ %b

source: %f of %n
khm: %f នៃ %n

source: %n mod %n
khm: សំណល់នៃ %n ចែកនឹង %n

source: add %s to %L
khm: បន្ថែមចំនួន %s ទៅអោយ %L

source: answer
khm: ចំលើយ

source: ask %s and wait
khm: សួរ %s ហើយរង់ចាំ

source: background #
khm: ផ្ទាំងខាងក្រោយ ទី

source: broadcast %e
khm: បញ្ជូនសារ %e

source: broadcast %e and wait
khm: បញ្ជូនសារ %e ហើយរង់ចាំ

source: change %g effect by %n
khm: ប្តូរ %g ដោយ %n

source: change %v by %n
khm: កែប្រែ %v ចំនួន %n

source: change pen color by %n
khm: ប្តូរកំរិតពណ៌ប៊ិចចំនួន %n

source: change pen shade by %n
khm: ប្តូរកំរិតភ្លឺនៃប៊ិចចំនួន %n

source: change pen size by %n
khm: ប្តូរទំហំក្បាលប៊ិចចំនួន %n

source: change size by %n
khm: ប្តូរទំហំចំនួន %n

source: change tempo by %n
khm: ប្តូរសង្វាក់ចំនួន %n

source: change volume by %n
khm: ប្តូរកម្រិតសម្លេងចំនួន %n

source: change x by %n
khm: ប្តូរ x ចំនួន %n

source: change y by %n
khm: ប្តូរ y ចំនួន %n

source: clear
khm: លុបទាំងអស់

source: clear graphic effects
khm: លុបបែបផែនក្រាហ្វិច

source: color %C is touching %C?
khm: ពណ៌ %C ប៉ះ %C?

source: control
khm: គ្រប់គ្រង

source: costume #
khm: រូបរាង ទី

source: delete %y of %L
khm: លុប %y ចំនួន %L

source: direction
khm: ទិសដៅ

source: distance to %m
khm: ចម្ងាយទៅ %m

source: else
khm: បើមិនដូច្នោះទេ

source: forever
khm: ធ្វើរហូត

source: forever if %b
khm: ធ្វើរហូតប្រសិនបើ %b

source: glide %n secs to x:%n y:%n
khm: រំកិល %n វិនាទី ទៅ x:%n y:%n

source: go back %n layers
khm: ថយក្រោយចំនួន %n ស្រទាប់

source: go to %m
khm: ទៅកាន់ %m

source: go to front
khm: ដាក់ទៅផ្ទាំងខាងមុខ

source: go to x:%n y:%n
khm: ទៅកាន់ x:%n y:%n

source: hide
khm: លាក់

source: hide variable %v
khm: លាក់អថេរ %v

source: if %b
khm: ប្រសិនបើ %b

source: if on edge, bounce
khm: បើនៅគែមឆាក, អោយខ្ទាតចេញ

source: insert %s at %i of %L
khm: បន្ថែមចំនួន %s ទៅ %i ចំនួន %L

source: item %i of %L
khm: ធាតុទី %i នៃ %L

source: join %s %s
khm: ភ្ជាប់ %s %s

source: key %k pressed?
khm: ក្តារចុច %k ត្រូវបានចុច?

source: length of %L
khm: ប្រវែងរបស់ %L

source: length of %s
khm: ប្រវែងរបស់ %s

source: letter %n of %s
khm: តួអក្សរ %n នៃ %s

source: list
khm: បញ្ជី

source: looks
khm: រូបរាង

source: loud?
khm: លឺខ្លាំង?

source: loudness
khm: កំរិតសម្លេង

source: motion
khm: ចលនា

source: motor direction %W
khm: ម៉ូទ័រក្នុងទិសដៅ %W

source: motor off
khm: បិទម៉ូទ័រ

source: motor on
khm: បើកម៉ូទ័រ

source: motor on for %n secs
khm: បើកម៉ូទ័ររយៈពេល %n វិនាទី

source: motor power %n
khm: ថាមពលម៉ូទ័រ %n

source: mouse down?
khm: ម៉ៅស៍ចុច ?

source: mouse x
khm: ទីតាំងព្រួញម៉ៅស៍ x

source: mouse y
khm: ទីតាំងព្រួញម៉ៅស៍ y

source: move %n steps
khm: ផ្លាស់ទី %n ជំហាន

source: next background
khm: ផ្ទាំងខាងក្រោយបន្ទាប់

source: next costume
khm: រូបរាងបន្ទាប់

source: not %b
khm: មិនមែន %b

source: operators
khm: ប្រមាណវិធី

source: pen
khm: ប៊ិច

source: pen down
khm: ទាញប៊ិចចុះ

source: pen up
khm: លើកប៊ិចឡើង

source: pick random %n to %n
khm: យកតំលៃចៃដន្យពី %n ទៅ %n

source: play drum %D for %n beats
khm: លេងសូរ %D ចំនួន %n ដង

source: play note %N for %n beats
khm: លេងណូត %N ចំនួន %n ដង

source: play sound %S
khm: លេងសម្លេង %S

source: play sound %S until done
khm: លេងសម្លេង %S រហូតចប់

source: point in direction %d
khm: ចង្អុលទៅទិសដៅ %d

source: point towards %m
khm: ចង្អុលទៅ %m

source: repeat %n
khm: ធ្វើដដែលៗចំនួន %n ដង

source: repeat until %b
khm: ធ្វើដដែលៗរហូតដល់ %b

source: replace item %i of %L with %s
khm: ជំនួសធាតុទី %i នៃ %L ដោយ %s

source: reset timer
khm: កំណត់ពេលវេលាសាជាថ្មី

source: rest for %n beats
khm: ឈប់លេងចំនួន %n ដង

source: round %n
khm: បង្គត់ %n

source: say %s
khm: និយាយ %s

source: say %s for %n secs
khm: និយាយ %s រយៈពេល %n វិនាទី

source: sensing
khm: ញាណ

source: sensor %h?
khm: ឧបករណ៍ចាប់សញ្ញា %h ?

source: set %g effect to %n
khm: កំណត់បែបផែន %g លើ %n

source: set %v to %n
khm: កំណត់ %v ទៅ %n

source: set instrument to %I
khm: កំណត់ឧបករណ៍ទៅជា %I

source: set pen color to %c
khm: កំណត់ពណ៌ទៅជា %c

source: set pen color to %n
khm: កំណត់ពណ៌ទៅជា %n

source: set pen shade to %n
khm: កំណត់ស្រមោលប៊ិចត្រឹម %n

source: set pen size to %n
khm: កំណត់ទំហំក្បាលប៊ិចត្រឹម %n

source: set size to %n%
khm: កំណត់ទំហំត្រឹម %n%

source: set tempo to %n bpm
khm: កំណត់សង្វាក់ត្រឹម %n bpm

source: set volume to %n%
khm: កំណត់កម្រិតសម្លេងត្រឹម %n%

source: set x to %n
khm: កំណត់ x ត្រឹម %n

source: set y to %n
khm: កំណត់ y ត្រឹម %n

source: show
khm: បង្ហាញ

source: show variable %v
khm: បង្ហាញអថេរ %v

source: size
khm: ទំហំ

source: sound
khm: សំលេង

source: stamp
khm: ត្រា

source: stop all
khm: បញ្ឈប៉ទាំងអស់

source: stop all sounds
khm: បញ្ឈប់សំលេងទាំងអស់

source: stop script
khm: បញ្ឈប់ ស្ក្រីប

source: switch to background %l
khm: ប្តូរផ្ទាំងខាងក្រោយទៅជា %l

source: switch to costume %l
khm: ប្តូររូបរាងទៅជា %l

source: tempo
khm: សង្វាក់

source: think %s
khm: គិតទៅ %s

source: think %s for %n secs
khm: គិតទៅ %s ចំនួន %n វិនាទី

source: timer
khm: ឧបករណ៍កំណត់ពេលវេលា

source: touching %m?
khm: ប៉ះ %m?

source: touching color %C?
khm: ប៉ះពណ៌ %C?

source: turn %n degrees
khm: បង្វិលចំនួន %n ដឺក្រេ

source: variables
khm: អថេរ

source: volume
khm: កម្រិតសម្លេង

source: wait %n secs
khm: រង់ចាំ %n វិនាទី

source: wait until %b
khm: រង់ចាំរហូតដល់ %b

source: when %k key pressed
khm: នៅពេលក្តាចុច %k ត្រូវបានចុច

source: when %m clicked
khm: នៅពេលគេចុច %m

source: when I receive %e
khm: នៅពេលទទួលបាន %e

source: x position
khm: ទីតាំង x

source: y position
khm: ទីតាំង y

source: (empty)
khm: (ទទេ)

source: 1 script
khm: 1 ស្ក្រីប

source: About Scratch
khm: អំពីកម្មវិធី Scratch

source: About this project:
khm: អំពីគម្រោងនេះ ៖

source: abs
khm: តំលៃដាច់ខាត

source: add comment
khm: បន្ថែមមតិយោបល់

source: add comment here
khm: បន្ថែមមតិយោបល់នៅទីនេះ

source: all
khm: ទាំងអស់

source: and
khm: និង

source: Animation
khm: ការធ្វើចលនា

source: any
khm: ណាមួយ

source: Art
khm: សិល្បះ

source: background
khm: ផ្ទាំងខាងក្រោយ

source: backgrounds
khm: ផ្ទាំងខាងក្រោយ

source: Backgrounds
khm: "ផ្ទាំងខាងក្រោយ"

source: brightness
khm: កម្រិតពន្លឺ

source: Brush size:
khm: ទំហំជក់ ៖

source: button
khm: ប៊ូតុង

source: button pressed
khm: ប៊ូតុងបានចុច

source: Camera
khm: កាមេរ៉ា

source: can rotate
khm: អាចវិល

source: cancel
khm: បោះបង់

source: Cancel
khm: បោះបង់

source: Choose a folder
khm: ជ្រើសរើសថតដាក់ឯកសារ

source: Choose new sprite from file
khm: ជ្រើសរើស តួអង្គថ្មី ពីឯកសាដែលមានស្រាប់

source: clean up
khm: សំអាត

source: Clear
khm: លុប

source: Clear canvas
khm: លុបផ្ទាំងក្រណាត់

source: Close and continue
khm: បញ្ឃប់ និង បន្ត

source: Close dialog?
khm: បិទប្រអប់ ?

source: Close paint editor?
khm: បិទកម្មវិធីកែពណ៌ ?

source: close port
khm: បិទច្រក

source: Close sound recorder?
khm: បិទឧបករណ៍ថតសម្លេង ?

source: color
khm: ពណ៌

source: Compress Images
khm: បង្ហាប់រូបភាព

source: Compress Sounds
khm: បង្ហាប់សម្លេង

source: Compress sounds and images
khm: បង្ហាប់សម្លេងនិងរូបភាព

source: Computer
khm: កុំព្យូទ័រ

source: connected
khm: បានភ្ជាប់

source: Connecting to
khm: កំពុងភ្ជាប់ទៅ

source: Copy
khm: ថតចម្លង

source: costume
khm: រូបរាង

source: costumes
khm: រូបរាង

source: Costumes
khm: រូបរាង

source: Could not read
khm: មិនអាចអាន

source: Could not read project; file may be damaged
khm: មិនអាចអានគម្រោង ; ឯកសារអាចមានការខូចខាត

source: Could not write file
khm: មិនអាចសរសេរឯកសារ

source: Create account
khm: បង្កើតគណនី

source: Create an empty project
khm: បង្កើតគម្រោងទទេ

source: Data sent. Waiting for response...
khm: ផ្ញើរទិន្នន័យចេញ។ កំពុងរង់ចាំការឆ្លើយតប...

source: delete
khm: លុប

source: Delete
khm: លុប

source: Delete a list
khm: លុបបញ្ជី

source: Delete a variable
khm: លុបអថេរ

source: Delete this background
khm: លុបផ្ទាំងខាងក្រោយនេះ

source: Delete this costume
khm: លុបរូបរាងនេះ

source: Delete this sound
khm: លុបសម្លេងនេះ

source: Delete this sprite
khm: លុបតួអង្គនេះ

source: Desktop
khm: កន្លែងធ្វើការ

source: disable remote sensor connections
khm: បិទការភ្ជាប់ទៅឧបករណ៍ចាប់សញ្ញាពីចម្ងាយ

source: distance
khm: ចម្ងាយ

source: Documents
khm: ឯកសារ

source: don't rotate
khm: កុំបង្វិល

source: Don't Save
khm: កុំរក្សាទុក

source: Done
khm: ចប់សព្ចគ្រប់

source: down
khm: ចុះ

source: down arrow
khm: ព្រួញចុះក្រោម

source: drag to resize
khm: អូសដើម្បីប្តូរទំហំ

source: drag to rotate
khm: អូសដើម្បីបង្វិល

source: draggable on website?
khm: អាចអូសបានលើគេហទំព័រ ?

source: duplicate
khm: ស្ទួន

source: Duplicate
khm: ស្ទួន

source: edge
khm: គែម

source: Edit
khm: កែសម្រួល

source: Ellipse tool (draw outlined or filled ellipse or circle)
khm: ឧបករណ៍គូសអេលីប (គូស ស៊ុមខាងក្រៅ ឬ ចាក់បំពេញផ្ទៃ, អេលីប ឬ រង្វង់)

source: enable remote sensor connections
khm: បើកការភ្ជាប់ទៅឧបករណ៍ចាប់សញ្ញាពីចម្ងាយ

source: Enter presentation mode
khm: ចូលម៉ូតបទបង្ហាញ

source: Eraser
khm: ជ័រលុប

source: Eraser size
khm: ទំហំជ័រលុប

source: Error!
khm: កំហុស !

source: Examples
khm: ឧទាហរណ៍

source: Exit presentation
khm: ចាកចេញពីបទបង្ហាញ

source: Exit presentation mode
khm: ចាកចេញពីម៉ូតបទបង្ហាញ

source: export
khm: នាំចេញ

source: Export Background
khm: នាំចេញផ្ទាំងខាងក្រោយ

source: Export Costume
khm: នាំចេញរូបរាង

source: Export failed
khm: នាំចេញបរាជ័យ

source: Export Sound
khm: នាំចេញសម្លេង

source: Export Sprite
khm: នាំចេញតួអង្គ

source: export this costume
khm: នាំចេញរូបរាងនេះ

source: export this sound
khm: នាំចេញសម្លេងនេះ

source: export this sprite
khm: នាំចេញតួអង្គនេះ

source: Extras menu
khm: ម៉ឺនុយបន្ថែម

source: Eyedropper tool (select a color)
khm: ឧបករណ៍កែពណ៌ភ្នែក (ជ្រើសរើសពណ៌ណាមួយ)

source: Failed:
khm: បានបរាជ័យ

source: false
khm: ខុស

source: File
khm: ឯកសារ

source: File not found
khm: ឯកសាររកមិនឃើញ

source: Fill tool (fill areas with color or gradient)
khm: ឧបករណ៍ចាក់បំពេញ (បំពេញផ្ទៃជាមួយនឹង ពណ៌ឬជម្រាល)

source: first
khm: ទីមួយ

source: fisheye
khm: ភ្នែកត្រី

source: Flash blocks (fast)
khm: ប្លុកញាក់ (លឿន)

source: Flash blocks (slow)
khm: ប្លុកញាក់ (យឺត)

source: Flip horizontally
khm: ត្រឡប់ផ្តេក

source: Flip vertically
khm: ត្រឡប់បញ្ឈរ

source: For all sprites
khm: សម្រាប់គ្រប់តួអង្គទាំងឡាយ

source: For this sprite only
khm: សម្រាប់តែតួអង្គនេះ

source: Game
khm: ល្បែង

source: Get surprise sprite
khm: យកតួអង្គភ្ញាក់ផ្អើល

source: Get the last thing deleted
khm: យករបស់ដែលលុបចុងក្រោយមកវិញ

source: Getting Started
khm: ការចាប់ផ្តើម

source: ghost
khm: ខ្មោច

source: Go To Scratch Website
khm: ចូលទៅកាន់គេហទំព័រ Scratch

source: grab screen region for new costume
khm: កាត់យកមួយផ្នែកនៃរូបភាពលើអេក្រង់ធ្វើជារូបរាងថ្មី

source: grab screen region for new sprite
khm: កាត់យកមួយផ្នែកនៃរូបភាពលើអេក្រង់ធ្វើជាតួអង្គថ្មី

source: Grow
khm: ពង្រីក

source: Grow sprite
khm: ពង្រីកតួអង្គ

source: hello
khm: សួស្តី

source: Hello!
khm: សួស្តី!

source: help
khm: ជំនួយ

source: Help
khm: ជំនួយ

source: Help Page
khm: ទំព័រជំនួយ

source: Help Screens
khm: អេក្រង់ជំនួយ

source: Hide Motor Blocks
khm: លាក់ប្លុកម៉ូទ័រ

source: High (biggest)
khm: ខ្ពស់ (ធំជាងគេ)

source: Hmm...
khm: ហ៊ឺរ...

source: Home
khm: ទំព័រដើម

source: Images compressed
khm: រូបភាពបង្ហាប់

source: import
khm: នាំចូល

source: Import
khm: នាំចូល

source: Import an image on top of your current canvas
khm: នាំចូលរូបភាព ដាក់នៅលើផ្ទាំងក្រណាត់បច្ចុប្បន្ន

source: Import Background
khm: នាំចូលផ្ទាំងខាងក្រោយ

source: Import Costume
khm: នាំចូលរូបរាង

source: Import Image
khm: នាំចូលរូបភាព

source: Import List
khm: នាំចូលបញ្ជី

source: Import Project
khm: នាំចូលគម្រោង

source: import project
khm: នាំចូលគម្រោង

source: Import Sound
khm: នាំចូលសម្លេង

source: Incompatible Scratch file format
khm: ឯកសារមិនមានទ្រង់ទ្រាយជាប្រភេទ Scratch

source: Is the folder read-only?
khm: តើថតដាក់ឯកសារជាប្រភេទ សម្រាប់តែអាន?

source: JPEG Quality (10-100)?
khm: គុណភាព JPEG (10-100)

source: kbytes
khm: គីឡូបៃ

source: Language
khm: ភាសា

source: large readout
khm: បង្ហាញអោយធំ

source: last
khm: ចុងក្រោយ

source: left
khm: ខាងឆ្វេង

source: left arrow
khm: ព្រួញខាងឆ្វេង

source: length
khm: ប្រវែង

source: light
khm: ពន្លឺ

source: Line tool (draw lines)
khm: ឩបករណ៍គូសបន្ទាត់

source: List name?
khm: ឈ្មោះរបស់បញ្ជី?

source: Low
khm: ទាប

source: Lowest (smallest)
khm: ទាបបំផុត (តូចបំផុត)

source: Make a list
khm: បង្កើតបញ្ជី

source: Make a variable
khm: បង្កើតអថេរថ្មី

source: Max:
khm: អតិបរមា ៖

source: meow
khm: ម៉ែវ

source: Message name:
khm: ឈ្មោះសារ :

source: Min:
khm: អប្បបរមា ៖

source: mod
khm: សំណល់

source: more
khm: បន្ថែម

source: More tags:
khm: ស្លាកបន្ថែមទៀត ៖

source: mosaic
khm: សិល្បៈនៃការផ្គុំ

source: mouse x:
khm: ទីតាំងព្រួញម៉ៅស៍ x :

source: mouse y:
khm: ទីតាំងព្រួញម៉ៅស៍ y :

source: mouse-pointer
khm: ព្រួញម៉ៅស៍

source: Move
khm: ផ្លាស់ទី

source: Music
khm: តន្ត្រី

source: My Projects
khm: គម្រោងរបស់ខ្ញុំ

source: new
khm: ថ្មី

source: New
khm: ថ្មី

source: New background:
khm: ផ្ទាំងខាងក្រោយថ្មី ៖

source: New costume:
khm: រូបរាងថ្មី ៖

source: New file name?
khm: ឈ្មោះឯកសារថ្មី?

source: New Filename:
khm: ឈ្មោះឯកសារថ្មី ៖

source: New sound:
khm: សម្លេងថ្មី ៖

source: New Sprite
khm: តួអង្គថ្មី

source: New sprite:
khm: តួអង្គថ្មី ៖

source: No
khm: ទេ

source: No MIDI ports currently available.
khm: ពេលបច្ចុប្បន្ន មិនមាន ច្រកមីឌី ដែលអាចប្រើបានទេ

source: No motion blocks
khm: មិនមាន ប្លុកចលនា​ ណាមួយទេ

source: no scripts
khm: មិនមាន ស្ក្រីប ណាមួយទេ

source: No serial ports found
khm: រកមិនឃើញ ច្រកសេរ៊ី ណាមួយទេ

source: No variables.
khm: មិនមាន អថេរ ណាមួយទេ

source: Normal
khm: ធម្មតា

source: normal readout
khm: បង្ហាញធម្មតា

source: Off
khm: បិទ/ផ្តាច់

source: OK
khm: យល់ព្រម

source: On
khm: បើក/ផ្ជាប់

source: only face left-right
khm: បង្វិល ឆ្វេង-ស្តាំ តែប៉ុណ្ណោះ

source: Open
khm: បើក

source: Open a Scratch project
khm: បើកគម្រោង Scratch

source: Open Project
khm: បើកគម្រោង

source: or
khm: ឬ

source: Paint
khm: គូសរូប

source: Paint Editor
khm: កែរូបគំនូរ

source: Paint new sprite
khm: គូស តួអង្គថ្មី

source: Paintbrush
khm: ជក់គូស

source: Password:
khm: ពាក្យសម្ងាត់ ៖

source: Percent? (100 gives original size)
khm: ភាគរយ? (100 = ទំហំដើម)

source: Pictures
khm: រូបភាព

source: pixelate
khm: បំបែកពិចសែល

source: play
khm: លេង

source: Please enter a number
khm: សូមបញ្ចូលលេខ

source: pop
khm: ប៉ុប

source: Position the cross-hair to set the rotation center
khm: ដាក់ព្រួញម៉ៅស៍នៅត្រង់ចំនុចខ្វែង ដើម្បីកំណត់ចំនុចកណ្តាលនៃរង្វិល

source: Preparing project...
khm: កំពុងរៀបចំគម្រោង...

source: Project author:
khm: អ្នករៀបចំគម្រោង :

source: Project name
khm: ឈ្មោះគម្រោង

source: Project Notes
khm: កំណត់សម្គាល់គម្រោង

source: Project notes
khm: កំណត់សម្គាល់គម្រោង

source: Project uploaded.
khm: គម្រោងផ្ញើរចេញរូចរាល់

source: Projects
khm: គម្រោងផ្សេងៗ

source: Quit
khm: ចាកចេញ

source: Quit Scratch
khm: ចាកចេញពីកម្មវិធី Scratch

source: Reading
khm: កំពុងអាន

source: record
khm: ថត

source: Record
khm: ថត

source: recording
khm: កំពុងថត

source: Rectangle tool (draw outlined or filled rectangle or square)
khm: ឩបករណ៍គូសចតុកោណ (គូស ចតុកោណ ឬ ការ៉េ, គូស គែម ឬ​ ចាក់បំពេញ)

source: Redo
khm: ធ្វើឡើងវិញ

source: Reference Guide
khm: ឯកសារបង្ហាញផ្លូវគោល

source: Remote sensor connections enabled
khm: ឧបករណ៍ចាប់សញ្ញាពីចម្ងាយត្រូវបានភ្ជាប់

source: Remove viewer from stage
khm: យក អ្នកមើល ចេញពីឆាក

source: resistance
khm: រ៉េស៊ីស្តង់

source: resize this sprite
khm: ប្តូរទំហំតួអង្គ

source: reverse
khm: ត្រឡប់ក្រោយ

source: right
khm: ខាងស្តាំ

source: right arrow
khm: ព្រួញខាងស្តាំ

source: Rotate clock-wise
khm: បង្វិលតាមទិសទ្រនិចនាឡិកា

source: Rotate counter-clock-wise
khm: បង្វិលតាមទិសច្រាស់នឹងទ្រនិចនាឡិកា

source: rotate this sprite
khm: បង្វិលតួអង្គ

source: Rotation degrees?
khm: មុំរង្វិល?

source: Save
khm: រក្សាទុក

source: Save a copy of the current project
khm: រក្សាទុកគម្រោងបច្ចុប្បន្នមួយច្បាប់ទៀត

source: Save As
khm: រក្សាទុកមួយច្បាប់ទៀត

source: Save changes before quitting?
khm: ធ្វើការរក្សាទុកមុននឹងចាកចេញ?

source: Save failed
khm: រក្សាទុកបរាជ័យ

source: save picture of scripts
khm: រក្សាទុក រូបភាពរបស់ស្ក្រីប

source: save picture of stage...
khm: រក្សាទុក រូបភាពរបស់ឆាក

source: Save Project
khm: រក្សាទុកគម្រោង

source: Save Scripts Snapshot
khm: រក្សាទុក ស្ក្រីប បែបជា រូបថតអេក្រង់

source: Save Stage Shot
khm: រក្សាទុក ឆាក បែបជារូបថត

source: Save the current project
khm: រក្សាទុកគម្រោងបច្ចុប្បន្ន

source: Save the current project?
khm: រក្សាទុកគម្រោងបច្ចុប្បន្នទេ?

source: Save this project
khm: រក្សាទុកគម្រោងនេះ

source: Scripts
khm: ស្ក្រីប

source: select serial/USB port
khm: ជ្រើសរើស ច្រក សេរ៊ី/យ៉ូអេសប៊ី

source: Select tool (move, modify, or delete selection)
khm: ជ្រើសរើសឧបករណ៍ (រំកិល, កែប្រែ ឬ​ លុប របស់ដែលជ្រើសរើស)

source: Set costume center
khm: កំណត់ចំនុចកណ្តាលនៃ រូបរាង

source: Set language
khm: កំណត់ ភាសា

source: Set rotation center
khm: កំណត់ ចំនុចកណ្តាលនៃរង្វិល

source: Set Single Stepping
khm: កំណត់ ម៉ូដជំហាន

source: set slider min and max
khm: កំណត់ តំលៃ អតិបរមា និង អប្បបរមា របស់ របាររំកិល

source: Share
khm: ចែករំលែក

source: Share this project
khm: ចែករំលែកគម្រោងនេះ

source: Share This Project Online
khm: ចែករំលែកគម្រោងនេះលើអ៊ិនធឺណែត

source: Show Motor Blocks
khm: បង្ហាញ​ ប្លុកម៉ូទ័រ

source: show ScratchBoard watcher
khm: បង្ហាញ អ្នកខ្លមមើលនៃ ScratchBoard

source: Shrink
khm: បង្រួម

source: Shrink sprite
khm: បង្រួមតួអង្គ

source: Simulation
khm: ការតាងដោយកម្មវិធី

source: Single-step speed?
khm: ល្បឿនជំហាន

source: slider
khm: របាររំកិល

source: Slider range:
khm: ចន្លោះតំលៃ របាររំកិល ៖

source: Sound quality:
khm: គុណភាពសម្លេង ៖

source: Sound Recorder
khm: ឧបករណ៍ថតសម្លេង

source: Sounds
khm: សម្លេង

source: Sounds compressed
khm: សម្លេងបង្ហាប់

source: space
khm: ចន្លោះ

source: Sprite
khm: តួអង្គ

source: Sprites
khm: តួអង្គទាំងឡាយ

source: sqrt
khm: ឬស

source: Stage
khm: ឆាក

source: Stage selected:
khm: ឆាកដែលជ្រើសរើស ៖

source: Stamp tool (select area, then stamp copies of it)
khm: ឧបករណ៍បោះត្រា (ជ្រើសរើសតំបន់ រួចបោះត្រាចំលង)

source: Start green flag scripts
khm: ដាក់អោយដំណើរការ ស្ក្រីប ដោយចុចលើ ទង់ពណ៌បៃតង

source: Start Single Stepping
khm: ដាក់អោយដំណើរការ ជាជំហាន

source: stop
khm: បញ្ឈប់

source: Stop everything
khm: បញ្ឈប៉ទាំងអស់

source: Stop Single Stepping
khm: បញ្ឃប់ដំណើរការ ជាជំហាន

source: Story
khm: រឿង

source: Support Site
khm: គេហទំព័រជំនួយ

source: Switch colors
khm: ប្តូរពណ៌

source: Switch to full stage
khm: ប្តូរទៅឆាកធំ

source: Switch to presentation mode
khm: ប្តូរទៅម៉ូតបង្ហាញ

source: Switch to small stage
khm: ប្តូរទៅឆាកតូច

source: Tags:
khm: ស្លាក ៖

source: Text tool (edit text layer)
khm: ឧបករណ៍កែអត្ថបទ (កែប្រែអត្ថបទ)

source: That variable name is already in use
khm: ឈ្មោះអថេរនេះមានប្រើប្រាស់រួចហើយ

source: The file name already exists. Overwrite existing file?
khm: ឈ្មោះឯកសារនេះមានរួចទៅហើយ។ តើចង់ជំនួសលើឯកសារដែលមានស្រាប់?

source: thing
khm: វត្ថុ

source: true
khm: ពិត

source: Turbo speed
khm: ល្បឿនលឿនខ្លាំង

source: turn into new sprite
khm: ប្រែក្លាយទៅជា តួអង្គថ្មី

source: Undelete
khm: កុំលុប

source: Undo
khm: មិនធ្វើវិញ

source: up
khm: ខាងលើ

source: up arrow
khm: ព្រួញខាងលើ

source: Updating thumbnails
khm: ធ្វើបច្ចុប្បន្នភាពរូបភាពតូច

source: Upload succeeded!
khm: បញ្ជូនទៅទុកដោយជោគជ័យ !

source: Upload to Scratch Server
khm: បញ្ជូនទៅទុកនៅ ម៉ាស៊ីនមេរបស់ Scratch

source: Uploading
khm: កំពុងបញ្ជូនទៅទុក

source: Variable name?
khm: ឈ្មោះអថេរ?

source: View on stage
khm: បង្ហាញនៅលើឆាក

source: What's your name?
khm: តើអ្នកឈ្មោះអ្វី?

source: whirl
khm: បង្វិល

source: world
khm: ពិភពលោក

source: Write Multiple Project Summaries
khm: សរសេរសេចក្តីសង្ខេបនៃគម្រោងទាំងឡាយ

source: Write Project Summary
khm: សរសេរសេចក្តីសង្ខេបនៃគម្រោង

source: Yes
khm: បាទ

source: Your project is now online at
khm: ឥឡូវនេះ គម្រោងរបស់អ្នកនៅលើអ៊ីនធឺណិត ត្រង់កន្លែង

source: Your Scratch website login name:
khm: ឈ្មោះចូលគេហទំព័រ Scratch របស់អ្នក ៖

source: Zoom in
khm: ពង្រីកចូល

source: Zoom out
khm: បង្រួមចេញ

source: Accordion
khm: អ័គ្គរដេអុង

source: Acoustic Bass
khm: សូរស័ព្ទបាស់

source: Acoustic Bass Drum
khm: សូរស័ព្ទស្គរបាស់

source: Acoustic Grand
khm: សូរស័ព្ទព្យាណូធំ

source: Acoustic Snare
khm: សូរស័ព្ទស្គរចង្កឹះ

source: Agogo
khm: អាហ្គហ្គោ

source: Alto Sax
khm: សាក់សូហ្វូន អាល់តូ

source: Applause
khm: ទះដៃ

source: Bagpipe
khm: ប៉ីស្កុតឡែន

source: Baritone Sax
khm: Saxophone bariton

source: Bass Drum 1
khm: Grosse caisse 1

source: Bassoon
khm: Basson

source: Bird Tweet
khm: Chant d'oiseaux

source: Blown Bottle
khm: Bouteille sifflé

source: Brass Section
khm: Section Cuivres

source: Breath Noise
khm: Respiration

source: Bright Acoustic
khm: Piano acoustique ( clair )

source: Cello
khm: Violoncelle

source: Chinese Cymbal
khm: Cymbale Chinoise

source: Choir Aahs
khm: Choeurs Aah

source: Church Organ
khm: Orgue d'Eglise

source: Clarinet
khm: Clarinette

source: Closed Hi-Hat
khm: Charleston fermé

source: Contrabass
khm: Contrebasse

source: Cowbell
khm: Cloches de vache

source: Crash Cymbal 1
khm: Cymbale Crash 1

source: Crash Cymbal 2
khm: Cymbale Crash 2

source: Distortion Guitar
khm: Guitare électrique à distorsion

source: Drawbar Organ
khm: Orgue Drawbar

source: Electric Bass (finger)
khm: បាស់អគ្គិសនី (ម្រាម)

source: Electric Bass (pick)
khm: បាស់អគ្គិសនី (រើស)

source: Electric Clean Guitar
khm: Guitare électrique pure

source: Electric Grand
khm: Grand piano électrique

source: Electric Jazz Guitar
khm: Guitare électrique Jazz

source: Electric Muted Guitar
khm: Guitare Electrique muette

source: Electric Piano 1
khm: Piano électrique 1

source: Electric Piano 2
khm: Piano électrique 2

source: Electric Snare
khm: Caisse électrique muette

source: English Horn
khm: Cor Anglais

source: FX 1 (rain)
khm: FX 1 (pluie)

source: FX 2 (soundtrack)
khm: FX 2 (piste son)

source: FX 4 (atmosphere)
khm: FX 4 (atmosphère)

source: FX 5 (brightness)
khm: FX 5 (brillant)

source: FX 7 (echoes)
khm: FX 7 (échos)

source: FX 8 (sci-fi)
khm: FX 8 (science-fiction)

source: Fiddle
khm: Violon (fiddle)

source: Flute
khm: Flûte

source: French Horn
khm: Cor Français

source: Fretless Bass
khm: Basse acoustique

source: Guitar Fret Noise
khm: Bruit de Frette (Guitare )

source: Guitar Harmonics
khm: Harmoniques guitare

source: Gunshot
khm: Coup de feu

source: Hand Clap
khm: Claquement de main

source: Harpsichord
khm: Clavecin

source: Helicopter
khm: Hélicoptère

source: Hi Bongo
khm: Bongo haut

source: Hi Wood Block
khm: Wood block haut

source: Hi-Mid Tom
khm: Ton médium haut

source: High Agogo
khm: Agogo haut

source: High Floor Tom
khm: Tom basse haut

source: High Timbale
khm: Timbale haute

source: High Tom
khm: Tom Alto

source: Honky-Tonk
khm: Piano Honky-Tonk

source: Lead 1 (square)
khm: Lead 1 (ការ៉េ)

source: Lead 2 (sawtooth)
khm: Lead 2 (ធ្មេញរណា)

source: Lead 3 (calliope)
khm: Lead 3 (orgue à vapeur)

source: Lead 6 (voice)
khm: Lead 6 (voix)

source: Lead 7 (fifths)
khm: Lead 7 (quinte)

source: Long Guiro
khm: Guiro long

source: Long Whistle
khm: Sifflet long

source: Low Agogo
khm: Agogo bas

source: Low Bongo
khm: Bongo bas

source: Low Conga
khm: Conga bas

source: Low Floor Tom
khm: Tom basse bas

source: Low Timbale
khm: Timbale basse

source: Low Tom
khm: Tom basse

source: Low Wood Block
khm: Bloc de bois bas

source: Low-Mid Tom
khm: Tom méduim bas

source: Melodic Tom
khm: Tom mélodique

source: Music Box
khm: Boîte à musique

source: Mute Cuica
khm: Cuica muet

source: Mute Hi Conga
khm: Conga haut muet

source: Mute Triangle
khm: Triangle muet

source: Muted Trumpet
khm: Trompette bouchée

source: Nylon String Guitar
khm: Guitare à cordes nylon

source: Oboe
khm: Hautbois

source: Open Cuica
khm: Conga ouvert haut

source: Open Hi Conga
khm: Conga ouvert haut

source: Open Hi-Hat
khm: Charleston ouvert

source: Open Triangle
khm: Triangle ouvert

source: Orchestral Strings
khm: Cordes d'orchestre

source: Overdriven Guitar
khm: Guitare électrique saturée

source: Pad 1 (new age)
khm: Bloc 1 (new age)

source: Pad 2 (warm)
khm: Bloc 2 (chaleureux)
