Repository: aenccambodia/S4A-Khm.po
Catalog: khm.po
Languages: khm

source: Pad 3 (polysynth)
khm: Bloc 3 (polysynthé)

source: Pad 4 (choir)
khm: Bloc 4 (choeur)

source: Pad 5 (bowed)
khm: Bloc 5 (archet)

source: Pad 6 (metallic)
khm: Pad 6 (metallique)

source: Pan Flute
khm: Flûte de pan

source: Pedal Hi-Hat
khm: Charleston pédale

source: Percussive Organ
khm: Orgue percussive

source: Pizzicato Strings
khm: Cordes pizzicato

source: Recorder
khm: Flûte de roseau

source: Reed Organ
khm: Orgue à anches

source: Reverse Cymbal
khm: Cymbale inversée

source: Ride Bell
khm: Cloche Ride

source: Ride Cymbal 1
khm: Cymbale Ride 1

source: Ride Cymbal 2
khm: Cymbale Ride 2

source: Rock Organ
khm: Orgue rock

source: Seashore
khm: Bord de mer

source: Short Guiro
khm: Guiro court

source: Short Whistle
khm: Sifflet court

source: Sitar
khm: Cithare

source: Slap Bass 1
khm: Basse Slap 1

source: Slap Bass 2
khm: Basse Slap 2

source: Soprano Sax
khm: Saxophone soprano

source: Splash Cymbal
khm: Cymbale splash

source: Steel Drums
khm: Tambours d'acier

source: Steel String Guitar
khm: Guitare accoustique (acier)

source: String Ensemble 1
khm: Ensemble de cordes 1

source: String Ensemble 2
khm: Ensemble de cordes 2

source: Synth Bass 1
khm: Basse synthétisée 1

source: Synth Bass 2
khm: Basse synthé 2

source: Synth Drum
khm: Tambour synthétisé

source: Synth Voice
khm: Voix synthétisée

source: SynthBrass 1
khm: Cuivre synthétisée 1

source: SynthBrass 2
khm: Cuivre synthétisée 2

source: SynthStrings 1
khm: Cordes synthétisées 1

source: SynthStrings 2
khm: Cordes synthétisées 2

source: Taiko Drum
khm: Tambour Taiko

source: Tambourine
khm: Tambourin

source: Tango Accordion
khm: Accordéon Tango

source: Telephone Ring
khm: Sonnerie de téléphone

source: Tenor Sax
khm: Saxophone tenor

source: Timpani
khm: Tambours Timpani

source: Tinkle Bell
khm: Clochettes

source: Tremolo Strings
khm: Cordes trémolo

source: Trumpet
khm: Trompette

source: Tubular Bells
khm: Cloches tubulaires

source: Viola
khm: Viole

source: Violin
khm: Violon

source: Voice Oohs
khm: Voix ouh

source: Whistle
khm: Sifflet

source: Woodblock
khm: Bloc de bois

source: value of sensor %t
khm: តំលៃរបស់សិនស័រ %t

source: sensor %V pressed?
khm: សិនស័រ %V ត្រូវបានចុច?

source: digital %w on
khm: ច្រកចេញឌីជីថល %w បើក

source: digital %w off
khm: ច្រកចេញឌីជីថល %w បិត

source: analog %X value %n
khm: ច្រកចូលអាណាឡូក %X មានតំលៃស្មើ %n

source: motor %Y off
khm: ម៉ូទ័រ %Y ឈប់

source: motor %Y direction %z
khm: ម៉ូទ័រ %Y ទិសដៅ %z

source: clockwise
khm: ស្របតាមទ្រនិចនាឡិកា

source: anticlockwise
khm: ច្រាស់នឹងទ្រនិចនាឡិកា

source: motor %Z angle %n
khm: ម៉ូទ័រ %Z មុំ %n

source: reset actuators
khm: កំណត់ឡើងវិញគ្រប់ឧបករណ៍ធ្វើចលនា

source: stop connection
khm: ផ្តាច់ទំនាក់ទំនង

source: resume connection
khm: ភ្ជាប់ទំនាក់ទំនងឡើងវិញ

source: show board
khm: បង្ហាញផ្ទាំងបញ្ជា

source: hide board
khm: លាក់ផ្ទាំងបញ្ជា

source: board go to x:%n y:%n
khm: យកផ្ទាំងបញ្ជាទៅទីតាំង x:%n y:%n

source: hide sensor board
khm: លាក់ផ្ទាំងសិនស័រ

source: show sensor board
khm: បង្ហាញផ្ទាំងសិនស័រ

source: use connection of sprite
khm: ប្រើប្រាស់ទំនាក់ទំនងជាមួយ​តួអង្គ

source: Use connection of sprite
khm: ប្រើប្រាស់ទំនាក់ទំនងជាមួយ​តួអង្គ

source: search board
khm: ស្វែងរក ផ្ទាំងបញ្ជា

source: Searching board...
khm: កំពុងស្វែងរក ផ្ទាំងបញ្ជា...

source: stop searching board
khm: បញ្ឈប់ការស្វែងរក ផ្ទាំងបញ្ជា

source: Board disconnected or the battery is running out
khm: ផ្ទាំងបញ្ជាត្រូវបានដកចេញ ឬ ថ្មរបស់វាអស់ថាមពល

source: Analog value must be an integer between 0 and 255
khm: តំលៃ​អាណាឡូក ត្រូវតែជា ចំនួនគត់ នៅចន្លោះរវាង ០​ និង ២៥៥

source: There's no connection
khm: មិនមានការតភ្ជាប់ទំនាក់ទំនងទេ

source: Connection stopped
khm: ទំនាក់ទំនង​ត្រូវបានកាត់ផ្តាច់

source: New connection
khm: ភ្ជាប់ទំនាក់ទំនងថ្មី

source: Get arduino sprite
khm: ទទួលយក​ តួអង្គ Arduino

source: Paint new arduino sprite
khm: គូស​ តួអង្គ Arduino ថ្មី

source: Choose new arduino sprite from file
khm: ជ្រើសរើស តួអង្គ Arduino ថ្មី ពី ឯកសាដែលមានស្រាប់

source: attached sprites
khm: ភ្ជាប់ទៅ ​តួអង្គទាំងឡាយ

source: turn into new arduino sprite
khm: ប្រែក្លាយទៅជា តួអង្គ Arduino ថ្មី

source: Accept
khm: យល់ព្រម

source: Host Mesh
khm: ដើរតួជាអ្នកផ្ទុកបណ្តាញ

source: Join Mesh
khm: ចូលរួមជាមួយបណ្តាញ

source: Show IP Address
khm: បង្ហាញអាសយដ្ឋានអាយភី

source: Stop Hosting Mesh
khm: បញ្ឃប់តួនាទីពីអ្នកផ្ទុកបណ្តាញ

source: Enter User Mode
khm: ចូលទៅកាន់ ម៉ូតអ្នកប្រើប្រាស់

source: Exit User Mode
khm: ចាកចេញពី ម៉ូតអ្នកប្រើប្រាស់

source: Save Image in User Mode
khm: រក្សាទុករូបភាពក្នុងម៉ូតអ្នកប្រើប្រាស់

source: Check For Updates...
khm: ពិនិត្យមើលដើម្បីធ្វើបច្ចុប្បន្នភាព...

source: No updates
khm: គ្មានការធ្វើបច្ចុប្បន្នភាពទេ

source: You are using the latest version available.
khm: អ្នកកំពុងប្រើប្រាស់​កម្មវិធីជំនាន់​ចុងក្រោយ​បំផុតហើយ.

source: Update available
khm: មានទិន្នន័យសម្រាប់ធ្វើបច្ចុប្បន្នភាព

source: New version available, please visit our website to download it.
khm: មាន​កម្មវិធី​ជំនាន់ថ្មីហើយ, សូមចូលទៅកាន់​គេហទំព័ររបស់យើង​ដើម្បីទាញយក.

source: New version available. Go to download page?
khm: មាន​កម្មវិធី​ជំនាន់ថ្មីហើយ។ តើអ្នកចង់ចូលទៅកាន់​គេហទំព័រដើម្បីទាញយកទេ?
